In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/titanic_train.csv')

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>0</td>
      <td>3</td>
      <td>Braund, Mr. Owen Harris</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>A/5 21171</td>
      <td>7.2500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>1</td>
      <td>1</td>
      <td>Cumings, Mrs. John Bradley (Florence Briggs Th...</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>PC 17599</td>
      <td>71.2833</td>
      <td>C85</td>
      <td>C</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>1</td>
      <td>3</td>
      <td>Heikkinen, Miss. Laina</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>STON/O2. 3101282</td>
      <td>7.9250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>1</td>
      <td>1</td>
      <td>Futrelle, Mrs. Jacques Heath (Lily May Peel)</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>113803</td>
      <td>53.1000</td>
      <td>C123</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>0</td>
      <td>3</td>
      <td>Allen, Mr. William Henry</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>373450</td>
      <td>8.0500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

In [12]:
df = df.iloc[:, [0,1,2,3,4,5]]

In [16]:
df.to_csv('./data/titanic_minimal.csv', index=False)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
dtypes: float64(1), int64(2), object(2)
memory usage: 34.9+ KB

In [26]:
df.loc[df.Survived == 0].loc[df.Age>50]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>6</th>
      <td>0</td>
      <td>1</td>
      <td>McCarthy, Mr. Timothy J</td>
      <td>male</td>
      <td>54.0</td>
    </tr>
    <tr>
      <th>33</th>
      <td>0</td>
      <td>2</td>
      <td>Wheadon, Mr. Edward H</td>
      <td>male</td>
      <td>66.0</td>
    </tr>
    <tr>
      <th>54</th>
      <td>0</td>
      <td>1</td>
      <td>Ostby, Mr. Engelhart Cornelius</td>
      <td>male</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>94</th>
      <td>0</td>
      <td>3</td>
      <td>Coxon, Mr. Daniel</td>
      <td>male</td>
      <td>59.0</td>
    </tr>
    <tr>
      <th>96</th>
      <td>0</td>
      <td>1</td>
      <td>Goldschmidt, Mr. George B</td>
      <td>male</td>
      <td>71.0</td>
    </tr>
    <tr>
      <th>116</th>
      <td>0</td>
      <td>3</td>
      <td>Connors, Mr. Patrick</td>
      <td>male</td>
      <td>70.5</td>
    </tr>
    <tr>
      <th>124</th>
      <td>0</td>
      <td>1</td>
      <td>White, Mr. Percival Wayland</td>
      <td>male</td>
      <td>54.0</td>
    </tr>
    <tr>
      <th>150</th>
      <td>0</td>
      <td>2</td>
      <td>Bateman, Rev. Robert James</td>
      <td>male</td>
      <td>51.0</td>
    </tr>
    <tr>
      <th>152</th>
      <td>0</td>
      <td>3</td>
      <td>Meo, Mr. Alfonzo</td>
      <td>male</td>
      <td>55.5</td>
    </tr>
    <tr>
      <th>155</th>
      <td>0</td>
      <td>1</td>
      <td>Williams, Mr. Charles Duane</td>
      <td>male</td>
      <td>51.0</td>
    </tr>
    <tr>
      <th>170</th>
      <td>0</td>
      <td>1</td>
      <td>Van der hoef, Mr. Wyckoff</td>
      <td>male</td>
      <td>61.0</td>
    </tr>
    <tr>
      <th>174</th>
      <td>0</td>
      <td>1</td>
      <td>Smith, Mr. James Clinch</td>
      <td>male</td>
      <td>56.0</td>
    </tr>
    <tr>
      <th>222</th>
      <td>0</td>
      <td>3</td>
      <td>Green, Mr. George Henry</td>
      <td>male</td>
      <td>51.0</td>
    </tr>
    <tr>
      <th>232</th>
      <td>0</td>
      <td>2</td>
      <td>Sjostedt, Mr. Ernst Adolf</td>
      <td>male</td>
      <td>59.0</td>
    </tr>
    <tr>
      <th>249</th>
      <td>0</td>
      <td>2</td>
      <td>Carter, Rev. Ernest Courtenay</td>
      <td>male</td>
      <td>54.0</td>
    </tr>
    <tr>
      <th>252</th>
      <td>0</td>
      <td>1</td>
      <td>Stead, Mr. William Thomas</td>
      <td>male</td>
      <td>62.0</td>
    </tr>
    <tr>
      <th>262</th>
      <td>0</td>
      <td>1</td>
      <td>Taussig, Mr. Emil</td>
      <td>male</td>
      <td>52.0</td>
    </tr>
    <tr>
      <th>280</th>
      <td>0</td>
      <td>3</td>
      <td>Duane, Mr. Frank</td>
      <td>male</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>317</th>
      <td>0</td>
      <td>2</td>
      <td>Moraweck, Dr. Ernest</td>
      <td>male</td>
      <td>54.0</td>
    </tr>
    <tr>
      <th>326</th>
      <td>0</td>
      <td>3</td>
      <td>Nysveen, Mr. Johan Hansen</td>
      <td>male</td>
      <td>61.0</td>
    </tr>
    <tr>
      <th>406</th>
      <td>0</td>
      <td>3</td>
      <td>Widegren, Mr. Carl/Charles Peter</td>
      <td>male</td>
      <td>51.0</td>
    </tr>
    <tr>
      <th>438</th>
      <td>0</td>
      <td>1</td>
      <td>Fortune, Mr. Mark</td>
      <td>male</td>
      <td>64.0</td>
    </tr>
    <tr>
      <th>456</th>
      <td>0</td>
      <td>1</td>
      <td>Millet, Mr. Francis Davis</td>
      <td>male</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>467</th>
      <td>0</td>
      <td>1</td>
      <td>Smart, Mr. John Montgomery</td>
      <td>male</td>
      <td>56.0</td>
    </tr>
    <tr>
      <th>487</th>
      <td>0</td>
      <td>1</td>
      <td>Kent, Mr. Edward Austin</td>
      <td>male</td>
      <td>58.0</td>
    </tr>
    <tr>
      <th>492</th>
      <td>0</td>
      <td>1</td>
      <td>Molson, Mr. Harry Markland</td>
      <td>male</td>
      <td>55.0</td>
    </tr>
    <tr>
      <th>493</th>
      <td>0</td>
      <td>1</td>
      <td>Artagaveytia, Mr. Ramon</td>
      <td>male</td>
      <td>71.0</td>
    </tr>
    <tr>
      <th>545</th>
      <td>0</td>
      <td>1</td>
      <td>Nicholson, Mr. Arthur Ernest</td>
      <td>male</td>
      <td>64.0</td>
    </tr>
    <tr>
      <th>555</th>
      <td>0</td>
      <td>1</td>
      <td>Wright, Mr. George</td>
      <td>male</td>
      <td>62.0</td>
    </tr>
    <tr>
      <th>582</th>
      <td>0</td>
      <td>2</td>
      <td>Downton, Mr. William James</td>
      <td>male</td>
      <td>54.0</td>
    </tr>
    <tr>
      <th>625</th>
      <td>0</td>
      <td>1</td>
      <td>Sutton, Mr. Frederick</td>
      <td>male</td>
      <td>61.0</td>
    </tr>
    <tr>
      <th>626</th>
      <td>0</td>
      <td>2</td>
      <td>Kirkland, Rev. Charles Leonard</td>
      <td>male</td>
      <td>57.0</td>
    </tr>
    <tr>
      <th>631</th>
      <td>0</td>
      <td>3</td>
      <td>Lundahl, Mr. Johan Svensson</td>
      <td>male</td>
      <td>51.0</td>
    </tr>
    <tr>
      <th>659</th>
      <td>0</td>
      <td>1</td>
      <td>Newell, Mr. Arthur Webster</td>
      <td>male</td>
      <td>58.0</td>
    </tr>
    <tr>
      <th>672</th>
      <td>0</td>
      <td>2</td>
      <td>Mitchell, Mr. Henry Michael</td>
      <td>male</td>
      <td>70.0</td>
    </tr>
    <tr>
      <th>684</th>
      <td>0</td>
      <td>2</td>
      <td>Brown, Mr. Thomas William Solomon</td>
      <td>male</td>
      <td>60.0</td>
    </tr>
    <tr>
      <th>694</th>
      <td>0</td>
      <td>1</td>
      <td>Weir, Col. John</td>
      <td>male</td>
      <td>60.0</td>
    </tr>
    <tr>
      <th>695</th>
      <td>0</td>
      <td>2</td>
      <td>Chapman, Mr. Charles Henry</td>
      <td>male</td>
      <td>52.0</td>
    </tr>
    <tr>
      <th>714</th>
      <td>0</td>
      <td>2</td>
      <td>Greenberg, Mr. Samuel</td>
      <td>male</td>
      <td>52.0</td>
    </tr>
    <tr>
      <th>745</th>
      <td>0</td>
      <td>1</td>
      <td>Crosby, Capt. Edward Gifford</td>
      <td>male</td>
      <td>70.0</td>
    </tr>
    <tr>
      <th>772</th>
      <td>0</td>
      <td>2</td>
      <td>Mack, Mrs. (Mary)</td>
      <td>female</td>
      <td>57.0</td>
    </tr>
    <tr>
      <th>851</th>
      <td>0</td>
      <td>3</td>
      <td>Svensson, Mr. Johan</td>
      <td>male</td>
      <td>74.0</td>
    </tr>
  </tbody>
</table>
</div>